app/controllers/movies_controller.rb

  def index
    @sort = params[:sort]
    @all_ratings = ['G', 'PG', 'PG-13']
    @selected_ratings = ['']


  if(@sort.nil?)                            #If not sorted
    if (params[:ratings].nil?)                      #If not rating filtered
      @selected_ratings = @all_ratings
      @movies = Movie.all
    else                                            #If rating filtered
      @selected_ratings = params[:ratings]
      @movies = Movie.where("rating IN (?)", @selected_ratings)
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13')) ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date